; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   sinkbasintype microwavetype fridgetype - receptacletype
   butterknifetype knifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   bathtubbasintype safetype cabinettype stoveburnertype toastertype armchairtype toiletpaperhangertype - receptacletype
   pillowtype soapbartype bowltype pantype toiletpaperrolltype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 location6 location7 location8 - location
   fridge_1 bathtubbasin_2 safe_3 cabinet_4 stoveburner_5 toaster_6 armchair_7 toiletpaperhanger_8 microwave_9 fridge_10 - receptacle
   pillow_1 soapbar_2 bowl_3 soapbar_4 bowl_5 pan_6 toiletpaperroll_7 bowl_8 - obj
 )
 (:init (receptacletype_0 fridge_1 fridgetype) (receptacletype_0 bathtubbasin_2 bathtubbasintype) (receptacletype_0 safe_3 safetype) (receptacletype_0 cabinet_4 cabinettype) (receptacletype_0 stoveburner_5 stoveburnertype) (receptacletype_0 toaster_6 toastertype) (receptacletype_0 armchair_7 armchairtype) (receptacletype_0 toiletpaperhanger_8 toiletpaperhangertype) (receptacletype_0 microwave_9 microwavetype) (receptacletype_0 fridge_10 fridgetype) (objecttype_0 pillow_1 pillowtype) (objecttype_0 soapbar_2 soapbartype) (objecttype_0 bowl_3 bowltype) (objecttype_0 soapbar_4 soapbartype) (objecttype_0 bowl_5 bowltype) (objecttype_0 pan_6 pantype) (objecttype_0 toiletpaperroll_7 toiletpaperrolltype) (objecttype_0 bowl_8 bowltype) (cancontain fridgetype bowltype) (cancontain fridgetype pantype) (cancontain bathtubbasintype soapbartype) (cancontain cabinettype soapbartype) (cancontain cabinettype bowltype) (cancontain cabinettype pantype) (cancontain cabinettype toiletpaperrolltype) (cancontain stoveburnertype pantype) (cancontain armchairtype pillowtype) (cancontain toiletpaperhangertype toiletpaperrolltype) (cancontain microwavetype bowltype) (pickupable pillow_1) (pickupable soapbar_2) (cleanable soapbar_2) (pickupable bowl_3) (isreceptacleobject bowl_3) (cleanable bowl_3) (coolable bowl_3) (pickupable soapbar_4) (cleanable soapbar_4) (pickupable bowl_5) (isreceptacleobject bowl_5) (cleanable bowl_5) (coolable bowl_5) (pickupable pan_6) (isreceptacleobject pan_6) (cleanable pan_6) (coolable pan_6) (pickupable toiletpaperroll_7) (pickupable bowl_8) (isreceptacleobject bowl_8) (cleanable bowl_8) (coolable bowl_8) (receptacleatlocation fridge_1 location5) (receptacleatlocation bathtubbasin_2 location1) (receptacleatlocation safe_3 location5) (receptacleatlocation cabinet_4 location8) (receptacleatlocation stoveburner_5 location7) (receptacleatlocation toaster_6 location7) (receptacleatlocation armchair_7 location7) (receptacleatlocation toiletpaperhanger_8 location8) (receptacleatlocation microwave_9 location3) (receptacleatlocation fridge_10 location6) (inreceptacle pillow_1 armchair_7) (inreceptacle soapbar_2 cabinet_4) (inreceptacle bowl_3 fridge_1) (inreceptacle soapbar_4 bathtubbasin_2) (inreceptacle bowl_5 cabinet_4) (inreceptacle pan_6 fridge_10) (inreceptacle toiletpaperroll_7 toiletpaperhanger_8) (inreceptacle bowl_8 fridge_1) (objectatlocation pillow_1 location7) (objectatlocation soapbar_2 location8) (objectatlocation bowl_3 location5) (objectatlocation soapbar_4 location1) (objectatlocation bowl_5 location8) (objectatlocation pan_6 location6) (objectatlocation toiletpaperroll_7 location8) (objectatlocation bowl_8 location5) (atlocation agent1 location5) (= (total-cost) 0))
 (:goal (and (exists (?r_0 - receptacle)
 (exists (?o_0 - obj)
 (and (coolable ?o_0) (objecttype_0 ?o_0 pantype) (receptacletype_0 ?r_0 fridgetype) (iscool ?o_0) (inreceptacle ?o_0 ?r_0))))))
 (:constraints (sometime (or (checked soapbar_2) (atlocation agent1 location1))))
 (:metric minimize (total-cost))
)

; plan
1. (gotolocation agent1 location5 location1)
   deleted: (atlocation agent1 location5)
   added: (atlocation agent1 location1)
   goals met: 0 of 1
2. (gotolocation agent1 location1 location6)
   deleted: (atlocation agent1 location1)
   added: (atlocation agent1 location6)
   goals met: 0 of 1
3. (pickupobject agent1 location6 pan_6 fridge_10)
   deleted: (inreceptacle pan_6 fridge_10) (objectatlocation pan_6 location6)
   added: (holds agent1 pan_6) (holdsany agent1)
   goals met: 0 of 1
4. (coolobject agent1 location6 fridge_10 pan_6)
   added: (iscool pan_6)
   goals met: 0 of 1
5. (putobject agent1 location6 pan_6 fridge_10 pantype fridgetype)
   deleted: (holds agent1 pan_6) (holdsany agent1)
   added: (inreceptacle pan_6 fridge_10) (objectatlocation pan_6 location6)
   goals met: 1 of 1
